Revit 2027 API
FamilyElementVisibility.IsShownInTopBottom Property
Indicates if the instance is display in Plan/RCP view of project document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsShownInTopBottom { get; set; }
Public Property IsShownInTopBottom As Boolean
	Get
	Set
public:
property bool IsShownInTopBottom {
	bool get ();
	void set (bool value);
}
member IsShownInTopBottom : bool with get, set
Property Value
Boolean
Remarks
This property matters for objects whose visibility type is Model.
See Also
Reference
FamilyElementVisibility Class
Autodesk.Revit.DB Namespace